tutorials/multiphase/interFoam/laminar/wave3D/system/refineMeshDictZ
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

set box;

coordinateSystem global;

globalCoeffs
{
    e1   (1 0 0);
    e2   (0 1 0);
}

directions
(
    e3
);

useHexTopology  true;

geometricCut    false;

writeMesh       false;


// ************************************************************************* //
